archive/stress_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
    <hashTree>
        <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
            testname="JSONPlaceholder Fixed Test Plan">
            <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
                <collectionProp name="Arguments.arguments" />
            </elementProp>
            <boolProp name="TestPlan.functional_mode">false</boolProp>
            <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
        </TestPlan>
        <hashTree>
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group"
                enabled="true">
                <intProp name="ThreadGroup.num_threads">400</intProp>
                <intProp name="ThreadGroup.ramp_time">3</intProp>
                <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
                <boolProp name="ThreadGroup.scheduler">false</boolProp>
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                    guiclass="LoopControlPanel" testclass="LoopController"
                    testname="Loop Controller">
                    <intProp name="LoopController.loops">10</intProp>
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                </elementProp>
            </ThreadGroup>
            <hashTree>
                <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                    testname="HTTP Header Manager" enabled="true">
                    <collectionProp name="HeaderManager.headers">
                        <elementProp name="Content-type" elementType="Header">
                            <stringProp name="Header.name">Content-type</stringProp>
                            <stringProp name="Header.value">application/json; charset=UTF-8</stringProp>
                        </elementProp>
                    </collectionProp>
                </HeaderManager>
                <hashTree />
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="GET Request" enabled="true">
                    <stringProp name="HTTPSampler.domain">jsonplaceholder.typicode.com</stringProp>
                    <stringProp name="HTTPSampler.protocol">https</stringProp>
                    <stringProp name="HTTPSampler.path">/posts/1</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
                    <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                        <collectionProp name="Arguments.arguments" />
                    </elementProp>
                </HTTPSamplerProxy>
                <hashTree>
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Code 200" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="200">200</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                        <boolProp name="Assertion.assume_success">false</boolProp>
                        <intProp name="Assertion.test_type">8</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Body Text" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="userId">userId</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                        <boolProp name="Assertion.assume_success">false</boolProp>
                        <intProp name="Assertion.test_type">2</intProp>
                    </ResponseAssertion>
                    <hashTree />
                </hashTree>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="PUT Request" enabled="false">
                    <stringProp name="HTTPSampler.domain">jsonplaceholder.typicode.com</stringProp>
                    <stringProp name="HTTPSampler.protocol">https</stringProp>
                    <stringProp name="HTTPSampler.path">/posts/1</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <stringProp name="HTTPSampler.method">PUT</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
                    <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                                <stringProp name="Argument.value">{"id": 1, "title": "foo", "body":
                                    "bar", "userId": 1}</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                </HTTPSamplerProxy>
                <hashTree>
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Code 200" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="200">200</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                        <boolProp name="Assertion.assume_success">false</boolProp>
                        <intProp name="Assertion.test_type">8</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Body Text" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="id">id</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                        <boolProp name="Assertion.assume_success">false</boolProp>
                        <intProp name="Assertion.test_type">2</intProp>
                    </ResponseAssertion>
                    <hashTree />
                </hashTree>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="PATCH Request" enabled="true">
                    <stringProp name="HTTPSampler.domain">jsonplaceholder.typicode.com</stringProp>
                    <stringProp name="HTTPSampler.protocol">https</stringProp>
                    <stringProp name="HTTPSampler.path">/posts/1</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <stringProp name="HTTPSampler.method">PATCH</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
                    <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                                <stringProp name="Argument.value">{"title": "changed"}</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                </HTTPSamplerProxy>
                <hashTree>
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Code 200" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="200">200</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                        <boolProp name="Assertion.assume_success">false</boolProp>
                        <intProp name="Assertion.test_type">8</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Body Text" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="title">title</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                        <boolProp name="Assertion.assume_success">false</boolProp>
                        <intProp name="Assertion.test_type">2</intProp>
                    </ResponseAssertion>
                    <hashTree />
                </hashTree>
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="DELETE Request" enabled="true">
                    <stringProp name="HTTPSampler.domain">jsonplaceholder.typicode.com</stringProp>
                    <stringProp name="HTTPSampler.protocol">https</stringProp>
                    <stringProp name="HTTPSampler.path">/posts/1</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <stringProp name="HTTPSampler.method">DELETE</stringProp>
                    <boolProp name="HTTPSampler.use_keepalive">false</boolProp>
                    <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                        <collectionProp name="Arguments.arguments" />
                    </elementProp>
                </HTTPSamplerProxy>
                <hashTree>
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Code 200" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="200">200</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                        <boolProp name="Assertion.assume_success">false</boolProp>
                        <intProp name="Assertion.test_type">8</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Body Text" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="{">{</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                        <boolProp name="Assertion.assume_success">false</boolProp>
                        <intProp name="Assertion.test_type">2</intProp>
                    </ResponseAssertion>
                    <hashTree />
                </hashTree>
            </hashTree>
        </hashTree>
    </hashTree>
</jmeterTestPlan>